Revit 2027 API
VisibleInViewFilter Class
 A quick filter that passes elements that are most likely visible in the given view.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.VisibleInViewFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class VisibleInViewFilter : ElementQuickFilter
Public Class VisibleInViewFilter
	Inherits ElementQuickFilter
public ref class VisibleInViewFilter : public ElementQuickFilter
type VisibleInViewFilter =
    class
        inherit ElementQuickFilter
    end
The VisibleInViewFilter type exposes the following members.
Constructors
Name | Description
VisibleInViewFilter(Document, ElementId) |  Constructs a new instance of a VisibleInViewFilter.
VisibleInViewFilter(Document, ElementId, Boolean) |  Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements.
Top
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory. In some situations (for example, when the element geometry is not yet calculated for the input view) this filter may return true even though the element may not actually be visible when geometry is calculated.
See Also
Reference
Autodesk.Revit.DB Namespace